xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxCan_bf.h
/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR30 */
#define IFX_CAN_N_TX_BAR_AR30_OFF (30u)

/** \brief Length for Ifx_CAN_N_TX_BAR_Bits.AR31 */
#define IFX_CAN_N_TX_BAR_AR31_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BAR_Bits.AR31 */
#define IFX_CAN_N_TX_BAR_AR31_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BAR_Bits.AR31 */
#define IFX_CAN_N_TX_BAR_AR31_OFF (31u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR0 */
#define IFX_CAN_N_TX_BCR_CR0_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR0 */
#define IFX_CAN_N_TX_BCR_CR0_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR0 */
#define IFX_CAN_N_TX_BCR_CR0_OFF (0u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR1 */
#define IFX_CAN_N_TX_BCR_CR1_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR1 */
#define IFX_CAN_N_TX_BCR_CR1_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR1 */
#define IFX_CAN_N_TX_BCR_CR1_OFF (1u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR2 */
#define IFX_CAN_N_TX_BCR_CR2_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR2 */
#define IFX_CAN_N_TX_BCR_CR2_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR2 */
#define IFX_CAN_N_TX_BCR_CR2_OFF (2u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR3 */
#define IFX_CAN_N_TX_BCR_CR3_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR3 */
#define IFX_CAN_N_TX_BCR_CR3_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR3 */
#define IFX_CAN_N_TX_BCR_CR3_OFF (3u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR4 */
#define IFX_CAN_N_TX_BCR_CR4_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR4 */
#define IFX_CAN_N_TX_BCR_CR4_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR4 */
#define IFX_CAN_N_TX_BCR_CR4_OFF (4u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR5 */
#define IFX_CAN_N_TX_BCR_CR5_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR5 */
#define IFX_CAN_N_TX_BCR_CR5_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR5 */
#define IFX_CAN_N_TX_BCR_CR5_OFF (5u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR6 */
#define IFX_CAN_N_TX_BCR_CR6_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR6 */
#define IFX_CAN_N_TX_BCR_CR6_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR6 */
#define IFX_CAN_N_TX_BCR_CR6_OFF (6u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR7 */
#define IFX_CAN_N_TX_BCR_CR7_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR7 */
#define IFX_CAN_N_TX_BCR_CR7_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR7 */
#define IFX_CAN_N_TX_BCR_CR7_OFF (7u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR8 */
#define IFX_CAN_N_TX_BCR_CR8_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR8 */
#define IFX_CAN_N_TX_BCR_CR8_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR8 */
#define IFX_CAN_N_TX_BCR_CR8_OFF (8u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR9 */
#define IFX_CAN_N_TX_BCR_CR9_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR9 */
#define IFX_CAN_N_TX_BCR_CR9_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR9 */
#define IFX_CAN_N_TX_BCR_CR9_OFF (9u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR10 */
#define IFX_CAN_N_TX_BCR_CR10_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR10 */
#define IFX_CAN_N_TX_BCR_CR10_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR10 */
#define IFX_CAN_N_TX_BCR_CR10_OFF (10u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR11 */
#define IFX_CAN_N_TX_BCR_CR11_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR11 */
#define IFX_CAN_N_TX_BCR_CR11_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR11 */
#define IFX_CAN_N_TX_BCR_CR11_OFF (11u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR12 */
#define IFX_CAN_N_TX_BCR_CR12_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR12 */
#define IFX_CAN_N_TX_BCR_CR12_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR12 */
#define IFX_CAN_N_TX_BCR_CR12_OFF (12u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR13 */
#define IFX_CAN_N_TX_BCR_CR13_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR13 */
#define IFX_CAN_N_TX_BCR_CR13_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR13 */
#define IFX_CAN_N_TX_BCR_CR13_OFF (13u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR14 */
#define IFX_CAN_N_TX_BCR_CR14_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR14 */
#define IFX_CAN_N_TX_BCR_CR14_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR14 */
#define IFX_CAN_N_TX_BCR_CR14_OFF (14u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR15 */
#define IFX_CAN_N_TX_BCR_CR15_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR15 */
#define IFX_CAN_N_TX_BCR_CR15_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR15 */
#define IFX_CAN_N_TX_BCR_CR15_OFF (15u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR16 */
#define IFX_CAN_N_TX_BCR_CR16_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR16 */
#define IFX_CAN_N_TX_BCR_CR16_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR16 */
#define IFX_CAN_N_TX_BCR_CR16_OFF (16u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR17 */
#define IFX_CAN_N_TX_BCR_CR17_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR17 */
#define IFX_CAN_N_TX_BCR_CR17_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR17 */
#define IFX_CAN_N_TX_BCR_CR17_OFF (17u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR18 */
#define IFX_CAN_N_TX_BCR_CR18_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR18 */
#define IFX_CAN_N_TX_BCR_CR18_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR18 */
#define IFX_CAN_N_TX_BCR_CR18_OFF (18u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR19 */
#define IFX_CAN_N_TX_BCR_CR19_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR19 */
#define IFX_CAN_N_TX_BCR_CR19_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCR_Bits.CR19 */
#define IFX_CAN_N_TX_BCR_CR19_OFF (19u)

/** \brief Length for Ifx_CAN_N_TX_BCR_Bits.CR20 */
#define IFX_CAN_N_TX_BCR_CR20_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCR_Bits.CR20 */
#define IFX_CAN_N_TX_BCR_CR20_MSK (0x1u)

