xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxCan_bf.h
/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE6 */
#define IFX_CAN_N_TX_BCIE_CFIE6_OFF (6u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE7 */
#define IFX_CAN_N_TX_BCIE_CFIE7_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE7 */
#define IFX_CAN_N_TX_BCIE_CFIE7_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE7 */
#define IFX_CAN_N_TX_BCIE_CFIE7_OFF (7u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE8 */
#define IFX_CAN_N_TX_BCIE_CFIE8_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE8 */
#define IFX_CAN_N_TX_BCIE_CFIE8_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE8 */
#define IFX_CAN_N_TX_BCIE_CFIE8_OFF (8u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE9 */
#define IFX_CAN_N_TX_BCIE_CFIE9_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE9 */
#define IFX_CAN_N_TX_BCIE_CFIE9_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE9 */
#define IFX_CAN_N_TX_BCIE_CFIE9_OFF (9u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE10 */
#define IFX_CAN_N_TX_BCIE_CFIE10_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE10 */
#define IFX_CAN_N_TX_BCIE_CFIE10_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE10 */
#define IFX_CAN_N_TX_BCIE_CFIE10_OFF (10u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE11 */
#define IFX_CAN_N_TX_BCIE_CFIE11_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE11 */
#define IFX_CAN_N_TX_BCIE_CFIE11_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE11 */
#define IFX_CAN_N_TX_BCIE_CFIE11_OFF (11u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE12 */
#define IFX_CAN_N_TX_BCIE_CFIE12_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE12 */
#define IFX_CAN_N_TX_BCIE_CFIE12_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE12 */
#define IFX_CAN_N_TX_BCIE_CFIE12_OFF (12u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE13 */
#define IFX_CAN_N_TX_BCIE_CFIE13_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE13 */
#define IFX_CAN_N_TX_BCIE_CFIE13_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE13 */
#define IFX_CAN_N_TX_BCIE_CFIE13_OFF (13u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE14 */
#define IFX_CAN_N_TX_BCIE_CFIE14_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE14 */
#define IFX_CAN_N_TX_BCIE_CFIE14_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE14 */
#define IFX_CAN_N_TX_BCIE_CFIE14_OFF (14u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE15 */
#define IFX_CAN_N_TX_BCIE_CFIE15_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE15 */
#define IFX_CAN_N_TX_BCIE_CFIE15_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE15 */
#define IFX_CAN_N_TX_BCIE_CFIE15_OFF (15u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE16 */
#define IFX_CAN_N_TX_BCIE_CFIE16_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE16 */
#define IFX_CAN_N_TX_BCIE_CFIE16_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE16 */
#define IFX_CAN_N_TX_BCIE_CFIE16_OFF (16u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE17 */
#define IFX_CAN_N_TX_BCIE_CFIE17_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE17 */
#define IFX_CAN_N_TX_BCIE_CFIE17_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE17 */
#define IFX_CAN_N_TX_BCIE_CFIE17_OFF (17u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE18 */
#define IFX_CAN_N_TX_BCIE_CFIE18_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE18 */
#define IFX_CAN_N_TX_BCIE_CFIE18_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE18 */
#define IFX_CAN_N_TX_BCIE_CFIE18_OFF (18u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE19 */
#define IFX_CAN_N_TX_BCIE_CFIE19_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE19 */
#define IFX_CAN_N_TX_BCIE_CFIE19_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE19 */
#define IFX_CAN_N_TX_BCIE_CFIE19_OFF (19u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE20 */
#define IFX_CAN_N_TX_BCIE_CFIE20_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE20 */
#define IFX_CAN_N_TX_BCIE_CFIE20_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE20 */
#define IFX_CAN_N_TX_BCIE_CFIE20_OFF (20u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE21 */
#define IFX_CAN_N_TX_BCIE_CFIE21_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE21 */
#define IFX_CAN_N_TX_BCIE_CFIE21_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE21 */
#define IFX_CAN_N_TX_BCIE_CFIE21_OFF (21u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE22 */
#define IFX_CAN_N_TX_BCIE_CFIE22_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE22 */
#define IFX_CAN_N_TX_BCIE_CFIE22_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE22 */
#define IFX_CAN_N_TX_BCIE_CFIE22_OFF (22u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE23 */
#define IFX_CAN_N_TX_BCIE_CFIE23_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE23 */
#define IFX_CAN_N_TX_BCIE_CFIE23_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE23 */
#define IFX_CAN_N_TX_BCIE_CFIE23_OFF (23u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE24 */
#define IFX_CAN_N_TX_BCIE_CFIE24_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE24 */
#define IFX_CAN_N_TX_BCIE_CFIE24_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE24 */
#define IFX_CAN_N_TX_BCIE_CFIE24_OFF (24u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE25 */
#define IFX_CAN_N_TX_BCIE_CFIE25_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE25 */
#define IFX_CAN_N_TX_BCIE_CFIE25_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE25 */
#define IFX_CAN_N_TX_BCIE_CFIE25_OFF (25u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE26 */
#define IFX_CAN_N_TX_BCIE_CFIE26_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE26 */
#define IFX_CAN_N_TX_BCIE_CFIE26_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE26 */
#define IFX_CAN_N_TX_BCIE_CFIE26_OFF (26u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE27 */
#define IFX_CAN_N_TX_BCIE_CFIE27_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE27 */
#define IFX_CAN_N_TX_BCIE_CFIE27_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE27 */
#define IFX_CAN_N_TX_BCIE_CFIE27_OFF (27u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE28 */
#define IFX_CAN_N_TX_BCIE_CFIE28_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE28 */
#define IFX_CAN_N_TX_BCIE_CFIE28_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE28 */
#define IFX_CAN_N_TX_BCIE_CFIE28_OFF (28u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE29 */
#define IFX_CAN_N_TX_BCIE_CFIE29_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE29 */
#define IFX_CAN_N_TX_BCIE_CFIE29_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE29 */
#define IFX_CAN_N_TX_BCIE_CFIE29_OFF (29u)

