xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxCan_bf.h
/** \brief Mask for Ifx_CAN_N_TT_OCF_Bits.EGTF */
#define IFX_CAN_N_TT_OCF_EGTF_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCF_Bits.EGTF */
#define IFX_CAN_N_TT_OCF_EGTF_OFF (24u)

/** \brief Length for Ifx_CAN_N_TT_OCF_Bits.ECC */
#define IFX_CAN_N_TT_OCF_ECC_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCF_Bits.ECC */
#define IFX_CAN_N_TT_OCF_ECC_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCF_Bits.ECC */
#define IFX_CAN_N_TT_OCF_ECC_OFF (25u)

/** \brief Length for Ifx_CAN_N_TT_OCF_Bits.EVTP */
#define IFX_CAN_N_TT_OCF_EVTP_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCF_Bits.EVTP */
#define IFX_CAN_N_TT_OCF_EVTP_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCF_Bits.EVTP */
#define IFX_CAN_N_TT_OCF_EVTP_OFF (26u)

/** \brief Length for Ifx_CAN_N_TT_MLM_Bits.CCM */
#define IFX_CAN_N_TT_MLM_CCM_LEN (6u)

/** \brief Mask for Ifx_CAN_N_TT_MLM_Bits.CCM */
#define IFX_CAN_N_TT_MLM_CCM_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_TT_MLM_Bits.CCM */
#define IFX_CAN_N_TT_MLM_CCM_OFF (0u)

/** \brief Length for Ifx_CAN_N_TT_MLM_Bits.CSS */
#define IFX_CAN_N_TT_MLM_CSS_LEN (2u)

/** \brief Mask for Ifx_CAN_N_TT_MLM_Bits.CSS */
#define IFX_CAN_N_TT_MLM_CSS_MSK (0x3u)

/** \brief Offset for Ifx_CAN_N_TT_MLM_Bits.CSS */
#define IFX_CAN_N_TT_MLM_CSS_OFF (6u)

/** \brief Length for Ifx_CAN_N_TT_MLM_Bits.TXEW */
#define IFX_CAN_N_TT_MLM_TXEW_LEN (4u)

/** \brief Mask for Ifx_CAN_N_TT_MLM_Bits.TXEW */
#define IFX_CAN_N_TT_MLM_TXEW_MSK (0xfu)

/** \brief Offset for Ifx_CAN_N_TT_MLM_Bits.TXEW */
#define IFX_CAN_N_TT_MLM_TXEW_OFF (8u)

/** \brief Length for Ifx_CAN_N_TT_MLM_Bits.ENTT */
#define IFX_CAN_N_TT_MLM_ENTT_LEN (12u)

/** \brief Mask for Ifx_CAN_N_TT_MLM_Bits.ENTT */
#define IFX_CAN_N_TT_MLM_ENTT_MSK (0xfffu)

/** \brief Offset for Ifx_CAN_N_TT_MLM_Bits.ENTT */
#define IFX_CAN_N_TT_MLM_ENTT_OFF (16u)

/** \brief Length for Ifx_CAN_N_TT_TURCF_Bits.NCL */
#define IFX_CAN_N_TT_TURCF_NCL_LEN (16u)

/** \brief Mask for Ifx_CAN_N_TT_TURCF_Bits.NCL */
#define IFX_CAN_N_TT_TURCF_NCL_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_TT_TURCF_Bits.NCL */
#define IFX_CAN_N_TT_TURCF_NCL_OFF (0u)

/** \brief Length for Ifx_CAN_N_TT_TURCF_Bits.DC */
#define IFX_CAN_N_TT_TURCF_DC_LEN (14u)

/** \brief Mask for Ifx_CAN_N_TT_TURCF_Bits.DC */
#define IFX_CAN_N_TT_TURCF_DC_MSK (0x3fffu)

/** \brief Offset for Ifx_CAN_N_TT_TURCF_Bits.DC */
#define IFX_CAN_N_TT_TURCF_DC_OFF (16u)

/** \brief Length for Ifx_CAN_N_TT_TURCF_Bits.ELT */
#define IFX_CAN_N_TT_TURCF_ELT_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_TURCF_Bits.ELT */
#define IFX_CAN_N_TT_TURCF_ELT_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_TURCF_Bits.ELT */
#define IFX_CAN_N_TT_TURCF_ELT_OFF (31u)

/** \brief Length for Ifx_CAN_N_TT_OCN_Bits.SGT */
#define IFX_CAN_N_TT_OCN_SGT_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCN_Bits.SGT */
#define IFX_CAN_N_TT_OCN_SGT_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCN_Bits.SGT */
#define IFX_CAN_N_TT_OCN_SGT_OFF (0u)

/** \brief Length for Ifx_CAN_N_TT_OCN_Bits.ECS */
#define IFX_CAN_N_TT_OCN_ECS_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCN_Bits.ECS */
#define IFX_CAN_N_TT_OCN_ECS_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCN_Bits.ECS */
#define IFX_CAN_N_TT_OCN_ECS_OFF (1u)

/** \brief Length for Ifx_CAN_N_TT_OCN_Bits.SWP */
#define IFX_CAN_N_TT_OCN_SWP_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCN_Bits.SWP */
#define IFX_CAN_N_TT_OCN_SWP_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCN_Bits.SWP */
#define IFX_CAN_N_TT_OCN_SWP_OFF (2u)

/** \brief Length for Ifx_CAN_N_TT_OCN_Bits.SWS */
#define IFX_CAN_N_TT_OCN_SWS_LEN (2u)

/** \brief Mask for Ifx_CAN_N_TT_OCN_Bits.SWS */
#define IFX_CAN_N_TT_OCN_SWS_MSK (0x3u)

/** \brief Offset for Ifx_CAN_N_TT_OCN_Bits.SWS */
#define IFX_CAN_N_TT_OCN_SWS_OFF (3u)

/** \brief Length for Ifx_CAN_N_TT_OCN_Bits.RTIE */
#define IFX_CAN_N_TT_OCN_RTIE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCN_Bits.RTIE */
#define IFX_CAN_N_TT_OCN_RTIE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCN_Bits.RTIE */
#define IFX_CAN_N_TT_OCN_RTIE_OFF (5u)

/** \brief Length for Ifx_CAN_N_TT_OCN_Bits.TMC */
#define IFX_CAN_N_TT_OCN_TMC_LEN (2u)

/** \brief Mask for Ifx_CAN_N_TT_OCN_Bits.TMC */
#define IFX_CAN_N_TT_OCN_TMC_MSK (0x3u)

/** \brief Offset for Ifx_CAN_N_TT_OCN_Bits.TMC */
#define IFX_CAN_N_TT_OCN_TMC_OFF (6u)

/** \brief Length for Ifx_CAN_N_TT_OCN_Bits.TTIE */
#define IFX_CAN_N_TT_OCN_TTIE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCN_Bits.TTIE */
#define IFX_CAN_N_TT_OCN_TTIE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCN_Bits.TTIE */
#define IFX_CAN_N_TT_OCN_TTIE_OFF (8u)

/** \brief Length for Ifx_CAN_N_TT_OCN_Bits.GCS */
#define IFX_CAN_N_TT_OCN_GCS_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCN_Bits.GCS */
#define IFX_CAN_N_TT_OCN_GCS_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCN_Bits.GCS */
#define IFX_CAN_N_TT_OCN_GCS_OFF (9u)

/** \brief Length for Ifx_CAN_N_TT_OCN_Bits.FGP */
#define IFX_CAN_N_TT_OCN_FGP_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCN_Bits.FGP */
#define IFX_CAN_N_TT_OCN_FGP_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCN_Bits.FGP */
#define IFX_CAN_N_TT_OCN_FGP_OFF (10u)

/** \brief Length for Ifx_CAN_N_TT_OCN_Bits.TMG */
#define IFX_CAN_N_TT_OCN_TMG_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCN_Bits.TMG */
#define IFX_CAN_N_TT_OCN_TMG_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCN_Bits.TMG */
#define IFX_CAN_N_TT_OCN_TMG_OFF (11u)

/** \brief Length for Ifx_CAN_N_TT_OCN_Bits.NIG */
#define IFX_CAN_N_TT_OCN_NIG_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCN_Bits.NIG */
#define IFX_CAN_N_TT_OCN_NIG_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCN_Bits.NIG */
#define IFX_CAN_N_TT_OCN_NIG_OFF (12u)

/** \brief Length for Ifx_CAN_N_TT_OCN_Bits.ESCN */
#define IFX_CAN_N_TT_OCN_ESCN_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCN_Bits.ESCN */
#define IFX_CAN_N_TT_OCN_ESCN_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCN_Bits.ESCN */
#define IFX_CAN_N_TT_OCN_ESCN_OFF (13u)

/** \brief Length for Ifx_CAN_N_TT_OCN_Bits.LCKC */
#define IFX_CAN_N_TT_OCN_LCKC_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OCN_Bits.LCKC */
#define IFX_CAN_N_TT_OCN_LCKC_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OCN_Bits.LCKC */
#define IFX_CAN_N_TT_OCN_LCKC_OFF (15u)

